Revit 2027 API
ColorFillScheme.AreEntriesConsistentWithScheme Method
 Checks whether the entries can be set to the scheme or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EntryAndSchemeConsistency AreEntriesConsistentWithScheme(
	IList<ColorFillSchemeEntry> entries
)
Public Function AreEntriesConsistentWithScheme (
	entries As IList(Of ColorFillSchemeEntry)
) As EntryAndSchemeConsistency
public:
EntryAndSchemeConsistency AreEntriesConsistentWithScheme(
	IList<ColorFillSchemeEntry^>^ entries
)
member AreEntriesConsistentWithScheme :
        entries : IList<ColorFillSchemeEntry> -> EntryAndSchemeConsistency
Parameters
entries IList<ColorFillSchemeEntry>
 The entries to check.
Return Value
EntryAndSchemeConsistency
 The state of the entries and scheme consistency.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace